# pandas loc and iloc

In [2]:
import pandas as pd

In [3]:
p=pd.read_csv('stock_data.csv')

In [4]:
p

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [5]:
p.loc[0] # it provide   row  through index number

tickers         GOOGL
eps             27.82
revenue            87
price             845
people     larry page
Name: 0, dtype: object

In [6]:
p.loc[4]

tickers          TATA
eps               5.6
revenue            -1
price            n.a.
people     ratan tata
Name: 4, dtype: object

In [7]:
p.loc[[0,2]]

  tickers    eps  revenue price      people
0   GOOGL  27.82       87   845  larry page
2    MSFT     -1       85    64  bill gates

In [8]:
p.loc[2,'eps']

'-1'

In [9]:
p.loc[1:4,'eps']

1             4.61
2               -1
3    not available
4              5.6
Name: eps, dtype: object

In [10]:
p.iloc[0]

tickers         GOOGL
eps             27.82
revenue            87
price             845
people     larry page
Name: 0, dtype: object

In [11]:
p.iloc[:,0:3]

  tickers            eps  revenue
0   GOOGL          27.82       87
1     WMT           4.61      484
2    MSFT             -1       85
3    RIL   not available       50
4    TATA            5.6       -1


# pandas Groupby

In [12]:
np=pd.read_csv('stock_data.csv')

In [13]:
np

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [23]:
gr1=np.groupby(['revenue']).mean()
gr1

DataError: No numeric types to aggregate